cases/cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    right
    {
        type            zeroGradient;
    }
    up
    {
        type            fixedValue;
        value           uniform ( 100 0 0 );
    }
    left
    {
        type            fixedValue;
        value           uniform ( 100 0 0 );
    }
    cylinder
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    z1
    {
        type            cyclic;
    }
    z2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
