cases/cylinder/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 101325;

boundaryField
{
    right
    {
        type            fixedValue;
        value           uniform 101325;
    }
    up
    {
        type            zeroGradient;
    }
    left
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
    z1
    {
        type            cyclic;
    }
    z2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
