cases/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    right
    {
        type            patch;
        nFaces          220;
        startFace       98720;
    }
    up
    {
        type            patch;
        nFaces          440;
        startFace       98940;
    }
    left
    {
        type            patch;
        nFaces          220;
        startFace       99380;
    }
    cylinder
    {
        type            patch;
        nFaces          80;
        startFace       99600;
    }
    z1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          49600;
        startFace       99680;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  z2;
    }
    z2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          49600;
        startFace       149280;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  z1;
    }
)

// ************************************************************************* //
