cases/cylinder/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
    {   
        name z1;
        patchInfo
        {   
            type cyclic;
            neighbourPatch z2;
        }
        constructFrom patches;
        patches (z1noc);
    }
    {   
        name z2;
        patchInfo
        {   
            type cyclic;
            neighbourPatch z1;
        }
        constructFrom patches;
        patches (z2noc);
    }
);

